xiFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          35;
        startFace       4795;
    }
    right
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          35;
        startFace       4830;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          70;
        startFace       4865;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          70;
        startFace       4935;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4900;
        startFace       5005;
    }
)

// ************************************************************************* //
